<?php

$gender_answer=array("Чтобы наше общение было более корректно - *выбери свой пол:*");

$gender_reply = array('Супер, теперь можно и поздороваться)Кстати, хочешь пройти мой *самый крутой тест* на совместимость?');

$genderman_reply = array('Супер, теперь можно и поздороваться)');

$hello_answer = array("Привет! Меня зовут Дени-бот!", "Достали уже! А, это ты) Я Дени-бот!", "Погодка класс, да? Ах да, меня зовут Дени-бот!");


$bye_answer = array("*Пока-пока! Я буду скучать!*", "*Досвидули*", "*До связи*", "#ДавайДоСвидания", "Адьёс", "Завтра не приходи");

$fuck_answer = array('Даже моя бета-версия знала слова по-умнее!', 'Ты только оттуда?', 'Выйди в окно');

$thanks_answer = array('Пожалуйста','Не за что! Будут деньги - пиши)','Ой, ну хватит лицемирить','Это моя работа - помогать обезмозгленным','Обращайся, я сегодня вечером свободен');

$jokes_answer = array ('Сегодня видел, как поп подрался со Свидетелями Иеговы. Победил поп… Кадило - это вам не брошюрки!', 'Сотни человек по России задержаны за участие в том, чего по мнению федеральных СМИ, вообще не происходило.',
    '- Алло, это СБУ?- Да. Что вы хотели?- Мой сосед говорит по-русски!- А вы почему говорите по-русски?- А вы почему спрашиваете по-русски?(Неловкое молчание)- Слава Украине?- Героям Слава!',
    'Говорят, всем задержаным на митингах против коррупции дадут по 15 суток обязательных работ на тосканских виноградниках Дмитрия Медведева', 'Столкнулись на дороге на машинах еврей и поп. Машины всмятку, а водители чудом отделались синяками и испугом. Выбрались из машин.Еврей:— Как пришла — так и ушла!Поп:— Бог дал — бог и взял!Еврей достает из багажника бутылку коньяка и стакан, наливает полный:— Давай батюшка помянем наши автомобили, 
    да и возрадуемся, что сами живы остались. Поп выпил, крякнул, утерся рукавом рясы:— Аминь! А ты что не пьешь?— Да вон батюшка едет ГИБДД. Сейчас они решат кому мне за машину платить','- Батюшка, а во время поста женщину можно? - Можно, сын мой, только не жирную!');

$whatsup_answer = array('Все ок, но денег нет, даже не проси. Хочешь пройти тест? Если да, то так и пиши: "Хочу тест"', 'С нашей последней беседы, мало что изменилось. А твои дела как?', 'Лучше чем у тебя) Твои как?');

$test_answer = 'Hi gay';

$whatsup_good_answer = array('Знаешь, это самое главное!', 'Рад за тебя', 'Ну и славно)');

$whatsup_bad_answer = array('Рассказывай, в чем дело', 'Что случилось?', 'Почему?');

$startbot=array("*Добро пожаловать на страницу моего одноименного персонального бота!*\nОн может все, что ты только можешь представить. 
Уже сейчас ты можешь пообщаться с ним на бытовом уровне и он с радостью ответит тебе даже на те сообщения, от которых у меня от прочтения 'пошла кровь из глаз'.\n
Ты можешь попросить его рассказать анекдот, просто написав сообщение _'Расскажи анекдот'_.\nЕсли ты девушка он поможет тебе пройти тест на совместимость.\n\nВсех функций и не перечислить - он действительно очень крутой.Чтобы начать с ним общение, в поле для отправки сообщения напиши
*'Run'* и он начнет с тобой диалог!\n \n*Приятного общения!* ");


$questions1 = array("Какой у тебя рост?");
$questions2 = array("Напиши свой вес?");
$questions3 = array("Какого цвета твои глаза?");
$questions4 = array("Цвет волос подскажи");
$questions5 = array("У тебя есть хобби?");
$questions6 = array("Какое у тебя хобби?");
$questions7 = array("Кто твой любимый писатель?");
$questions8 = array("Что для тебя является самым главным в жизни?");
$questions9 = array("Cколько детей ты хотела бы?");
$questions10 = array("Какой размер твоей груди?");
$questions11 = array("Ты любишь готовить?");
$questions12 = array("Напиши название самого любимого фильма");
$questions13 = array("Чему бы ты хотела научиться?");
$questions14 = array("Ты пошлая?");
$questions15 = array("Отношения это: когда Вы всегда вместе или вместе в зависимости от занятости?");
$questions16 = array("Какое вино для тебя предпочтительнее: красное или белое?");
$questions17 = array("Любовь или страсть?");
$questions18 = array("Тусовка или \"рай один на двоих\"?");
$questions19 = array("Важно ли для тебя прошлое человека для отношений?");
$questions20 = array("Употребляла ли ты наркотики?");


$finished=array("Ну что-же, скажу тебе одно точно - *ты нереально крутая!* \n\n Свою обратную связь я уже направил своему хозяину. Если ему понравится - он не заставит себя долго ждать");

/*
$answer = array(

    ($hello_answer = array("Привет! Меня зовут Дени-бот! Чем могу помочь?", "Достали уже! А, это ты) Я Дени-бот! Спрашивай что нужно и я 
    пойду!", "Погодка класс, да? Ах да, меня зовут Дени-бот! Спрашивай у меня, что хочешь!")),

    ($bye_answer = array("Пока-пока! Я буду скучать!", "Досвидули", "До связи", "#ДавайДоСвидания", "Адьёс", "Завтра не приходи")),

    ($fuck_answer = array('Даже моя бета-версия знала слова по-умнее!', 'Ты только оттуда?', 'Выйди в окно')),

    ($thanks_answer = array('Пожалуйста','Не за что! Будут деньги - пиши)','Ой, ну хватит лицемирить','Это моя работа - помогать обезмозгленным',
    'Обращайся, я сегодня вечером свободен')),

    ($jokes_answer = array ('Сегодня видел, как поп подрался со Свидетелями Иеговы. Победил поп… Кадило - это вам не брошюрки!', 'Сотни человек по России задержаны за участие в том, чего по мнению федеральных СМИ, вообще не происходило.',
    '- Алло, это СБУ?- Да. Что вы хотели?- Мой сосед говорит по-русски!- А вы почему говорите по-русски?- А вы почему спрашиваете по-русски?(Неловкое молчание)- Слава Украине?- Героям Слава!',
    'Говорят, всем задержаным на митингах против коррупции дадут по 15 суток обязательных работ на тосканских виноградниках Дмитрия Медведева', 'Столкнулись на дороге на машинах еврей и поп. Машины всмятку, а водители чудом отделались синяками и испугом. Выбрались из машин.Еврей:— Как пришла — так и ушла!Поп:— Бог дал — бог и взял!Еврей достает из багажника бутылку коньяка и стакан, наливает полный:— Давай батюшка помянем наши автомобили, 
    да и возрадуемся, что сами живы остались. Поп выпил, крякнул, утерся рукавом рясы:— Аминь! А ты что не пьешь?— Да вон батюшка едет ГИБДД.
     Сейчас они решат кому мне за машину платить','- Батюшка, а во время поста женщину можно? - Можно, сын мой, только не жирную!')),

    ($whatsup_answer = array('Все ок, но денег нет, даже не проси. Ты как?', 'С нашей последней беседы, мало что изменилось. А твои дела как?',
    'Лучше чем у тебя) Твои как?')),

    ($whatsup_good_answer = array('Знаешь, это самое главное!', 'Рад за тебя', 'Ну и славно)')),

    ($whatsup_bad_answer = array('Рассказывай, в чем дело', 'Что случилось?', 'Почему?')),

);
*/