<?php

$hello_case = array('привет', 'приветики','привет!','дратути','здорова!','здорово','хай', 'добрый день','добрый день!',
'приветствую!','здравствуй','здравствуй!','доброе утро!','доброе утро','добрый вечер!','добрый вечер',);


$bye_case = array('пока','пока денис!','пока ден','досвидания!','досвидули!','покеда','до завтра!', 'до завтра',
'до скорой встречи!','я ушел!','я ушла!','я ушел','я ушла','пока пока','пока-пока','адьёс','адьос',);

$fuck_case = array('пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил', 'иди в жопу', 'иди в жопу!',
'пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил', 'иди в пизду','иди в пизду!');

$thanks_case = array ('спасибо', 'спасибо!', 'спасибо большое', 'спасибо большое!','сенкс', 'пасиб', 'пасибки','от души', 'благодарю', 'благодарю!');

$jokes_case = array ('денис, расскажи анекдот', 'ден расскажи анекдот', 'расскажи анекдот','дэн, расскажи анекдот', 'расскажи шутку', 'пошути', 'я хочу анекдот');

$whatsup_case = array ('как ты?', 'как дела?', 'что нового?','как ты братка?', 'как твои дела?', 'все хорошо?', 'ты в порядке?');

$whatsup_good_case = array ('хорошо!', 'супер', 'гуд', 'отлично', 'заебись', 'збс', 'все нормально вроде', 'норм вроде',
'настроение супер');

$whatsup_bad_case = array('да не особо', 'хреново', 'да так', 'не очень', 'плохо', 'я расстроена', 'надоело все', 'заебало все', 'домой хочу',
'не хочу работать', 'по тебе соскучилась', 'пойдет');


$start_quest = array('хочу тест', 'хочу тест!');


########################## new array assoc #########################
/*
$cases = array(
    ($hello_case = array("привет","привет!","дратути","здорова!","здорово","хай", "добрый день","добрый день!",
    'приветствую!','здравствуй','здравствуй!','доброе утро!',"доброе утро","добрый вечер!","добрый вечер")),

    ($bye_case = array('пока','пока денис!','пока ден','досвидания!','досвидули!','покеда','до завтра!', 'до завтра',
    'до скорой встречи!','я ушел!','я ушла!','я ушел','я ушла','пока пока','пока-пока','адьёс','адьос')),


    ($fuck_case = array('пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил', 'иди в жопу', 'иди в жопу!',
    'пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил',
        'иди в пизду','иди в пизду!')),

    ($thanks_case = array ('спасибо', 'спасибо!', 'спасибо большое', 'спасибо большое!','сенкс', 'пасиб', 'пасибки','от души', 'благодарю',
        'благодарю!')),


    ($jokes_case = array ('денис, расскажи анекдот', 'ден расскажи анекдот', 'расскажи анекдот','дэн, расскажи анекдот', 'расскажи шутку',
        'пошути', 'я хочу анекдот')),


    ($whatsup_case = array ("как ты?", 'как дела?', 'что нового?','как ты братка?', 'как твои дела?', 'все хорошо?', 'ты в порядке?')),


    ($whatsup_good_case = array('хорошо!', 'супер', 'гуд', 'отлично', 'заебись', 'збс', 'все нормально вроде', 'норм вроде',
    'настроение супер')),

    ($whatsup_bad_case = array('да не особо', 'хреново', 'да так', 'не очень', 'плохо', 'я расстроена', 'надоело все', 'заебало все', 'домой хочу',
    'не хочу работать', 'по тебе соскучилась', 'пойдет'))
);
*/