<?php
$hello_case = array('привет','привет!','дратути','здорова!','здорово','хай', 'добрый день','добрый день!',
'приветствую!','здравствуй','здравствуй!','доброе утро!','доброе утро','добрый вечер!','добрый вечер',);


$bye_case = array('пока','пока денис!','пока ден','досвидания!','досвидули!','покеда','до завтра!', 'до завтра',
'до скорой встречи!','я ушел!','я ушла!','я ушел','я ушла','пока пока','пока-пока','адьёс','адьос',);

$fuck_case = array('пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил', 'иди в жопу', 'иди в жопу!',
'пошел на хуй!','пошел на хуй', 'пошел ты!','пошел ты', 'заебал!','заебал', 'ты долбоеб?','ты долбоеб', 'ты дебил?','ты дебил', 'иди в пизду','иди в пизду!');

$demand_case = array('Как выставлять требование?', 'Что такое требование?', 'Требование - что это?','Банковская аргументация', 'Что такое банковская аргументация',
    'Как применять требование?', 'Как применять банковскую аргументацию?', 'Научи выставлять требование!','Научи применять требование!', 'Научи применять банковскую аргументацию');

$thanks_case = array ('спасибо', 'спасибо!', 'спасибо большое', 'спасибо большое!','сенкс', 'пасиб', 'пасибки','от души', 'благодарю', 'благодарю!');

$jokes_case = array ('денис, расскажи анекдот', 'ден расскажи анекдот', 'расскажи анекдот','дэн, расскажи анекдот', 'расскажи шутку', 'пошути', 'я хочу анекдот');

$whatsup_case = array ('как ты?', 'как дела?', 'что нового?','как ты братка?', 'как твои дела?', 'все хорошо?', 'ты в порядке?');
